** Used codes
   According to Nyall's documentation, each symbol's layer contains a two bytes
   code indicating the symbol type followed by a unknown sequence that it's
   always the same ~14 79 92 C8 D0 11 8B B6 08 00 09 EE 4E 41~.
   I want to extract all the codes used in my 1203 symbols to verify how many of
   them are not currently managed by Nyall's tool. 

#+BEGIN_SRC python :dir bin :results verbatim :session rev
  import binascii
  import re
  from os import listdir


  def get_all_symbol_codes_in_a_file(file):
      hex_data = binascii.hexlify(open(file, "rb").read())
      rx = re.compile(b"(....)147992c8d0118bb6080009ee4e41")
      return rx.findall(hex_data)


  def get_all_symbol_codes():
      all_codes = set()
      for f in listdir("."):
          codes = get_all_symbol_codes_in_a_file(f)
          all_codes |= set(codes)
      return all_codes


  get_all_symbol_codes()
#+END_SRC

   #+RESULTS:
   : {b'fee5', b'ffe5', b'00e6', b'02e6', b'08e6', b'fae5', b'03e6', b'fce5', b'04e6', b'fde5', b'06e6', b'fbe5', b'f9e5'}


   Among these codes: 
   - fee5 -> recognized by the tool as SimpleMarkerSymbolLayer
   - f9e5 -> recognized as SimpleLineSymbolLayer
   - 04e6 -> recognized as FillSymbol
   - fae5 -> recognized as LineSymbol
   - fbe5 -> recognized as CartographicLineSymbolLayer
   - 03e6 -> recognized as SimpleFillSymbolLayer
   - 00e6 -> recognized as CharacterMarkerSymbolLayer
   - ffe5 -> recognized an MarkerSymbol
   - 02e6 -> not recognized (commented into the code as PictureMarkerSymbolLayer)
   - fde5 -> not recognized
   - 06e6 -> not recognized
   - 08e6 -> not recognized
   - fce5 -> not recognized
   So we have 8 recognized and managed and 5 not recognized types.
*** Points
    #+BEGIN_SRC python :dir bin :results pp :session rev
     from fnmatch import filter

     def get_all_symbol_codes_by_prefix(prefix):
         all_codes = set()
         for f in filter(listdir("."), prefix):
             codes = get_all_symbol_codes_in_a_file(f)
             all_codes |= set(codes)
         return all_codes

     get_all_symbol_codes_by_prefix("P_*")
    #+END_SRC

    #+RESULTS:
	: {b'03e6', b'fee5', b'ffe5', b'00e6', b'02e6', b'04e6', b'f9e5'}

*** Lines
    #+BEGIN_SRC python :dir bin :results verbatim :session rev
     get_all_symbol_codes_by_prefix("L_*")
    #+END_SRC

   #+RESULTS:
   : {b'03e6', b'fee5', b'ffe5', b'00e6', b'02e6', b'08e6', b'fce5', b'04e6', b'fde5', b'fae5', b'fbe5', b'f9e5'}

*** Polygons
    #+BEGIN_SRC python :dir bin :results verbatim :session rev
     get_all_symbol_codes_by_prefix("S_*")
    #+END_SRC

   #+RESULTS:
   : {b'03e6', b'ffe5', b'00e6', b'08e6', b'fce5', b'04e6', b'fde5', b'fae5', b'06e6', b'fbe5', b'f9e5'}

